app/Controllers/Admin/AdminCommonController.php

SELECT *
FROM `products`
WHERE `stock_qty` > 0
AND `is_published` = 1
ORDER BY `id` DESC
SELECT *
FROM `media_managers`
WHERE `id` IS NULL
SELECT *
FROM `product_variation_stocks`
WHERE `product_variation_id` = '68'
 LIMIT 1
---
    public function get_products()
    {
        try {
            $ProductsModels = new ProductsModel();
            $units = new UnitsModel();
            $ProductcategoriesModels = new ProductcategoriesModel();
            $ProductsModels->where('stock_qty >', 0);
            $ProductsModels->where('is_published', 1);
            $ProductsModels->where('is_deleted', 0);
            $ProductsModels->orderBy('id', 'desc');
            $data = $ProductsModels->findAll();
            $resposneData = [];
            $ProductVariationsModel = new ProductVariationStocksModel();
            $mediaModel = new Media_managersModel();
            $TaxesModels = new TaxesModel();
            foreach ($data as $resposne) {
                $mediaModel->where('id', $resposne['thumbnail_image']);
                $imageUrl = $mediaModel->findAll();
                $ProductsModelsdata = $ProductVariationsModel->where('product_variation_id ', $resposne['id'])->first();

SELECT *
FROM `taxes`
WHERE `id` = '1'
 LIMIT 1
---
                    'payment_account' => [],
                    'country' => [],
                    'state' => [],
                    'tax_details' => $TaxesModels->where('id', $resposne['tax_id'])->first(),

SELECT *
FROM `product_categories`
WHERE `product_id` = '68'
 LIMIT 1
---
                    'variations' => $ProductsModelsdata,
                    'unit_id' => isset($resposne['unit_id']) ? $resposne['unit_id'] : null,
                    'unit_details' => $units->where('id', $resposne['unit_id'])->first(),
                    'categories' => $ProductcategoriesModels->where('product_id', $resposne['id'])->first(),

SELECT *
FROM `users`
WHERE `id` = '1'
---
    public function AdminUpdtaeStatus($id)
    {

        try {
            $userModel = new UsersModel();

            $existingUser = $userModel->find($id);