app/Controllers/Admin/CounterNumberController.php

    public function getCounterNumber()
    {
        $counter = $this->counternumberModel->findAll();
---
SELECT *
FROM `counter_number`