app/Controllers/Admin/DashBoardController.php

SELECT *
FROM `categories`
---
            $data['TOTAL CUSTOMER'] = $result8->get()->getNumRows();

            // =====TOTAL CATEGORY
            $data['CATEGORY'] = $categoriestable->get()->getNumRows();