app/Controllers/Admin/ProductController.php

public function getProductByLocationId()
{
    $data = $this->request->getGet();
    $locationId = $data['locationId'] ?? null;

    if ($locationId === null) {
        return $this->response->setStatusCode(400)->setJSON(['error' => 'Invalid location ID']);
    }

    $locationModel = new LocationsModel();
    $location = $locationModel->find($locationId);

    if ($location === null) {
        return $this->response->setStatusCode(404)->setJSON(['error' => 'Location not found']);
    }

    $productModel = new ProductsModel();

    $products = $productModel
        ->where('location_id', $locationId)
        ->where('is_published', 1)
        ->findAll();
---
SELECT *
FROM `locations`
WHERE `locations`.`id` = '2'
SELECT *
FROM `products`
WHERE `location_id` = '2'
AND `is_published` = 1