app/Models/Admin/CategoriesModel.php

SELECT *
FROM `categories`
ORDER BY `total_sale_count` DESC
---
    public function getAllCategories()
    {

        return $this->orderBy('total_sale_count', 'DESC')->findAll();