app/Models/Admin/UserAddressesModel.php

SELECT `user_addresses`.*, `cities`.`name` as `citiesname`, `countries`.`name` as `countriesname`, `states`.`name` as `statesname`
FROM `user_addresses`
JOIN `cities` ON `user_addresses`.`city_id` = `cities`.`id`
JOIN `countries` ON `user_addresses`.`country_id` = `countries`.`id`
JOIN `states` ON `user_addresses`.`state_id` = `states`.`id`
WHERE `user_addresses`.`user_id` = '1'
---
    public function getUserAddressDetails($userId)
    {
        return $this->select('user_addresses.*, cities.name as citiesname, countries.name as countriesname, states.name as statesname')
            ->join('cities', 'user_addresses.city_id = cities.id')
            ->join('countries', 'user_addresses.country_id = countries.id')
            ->join('states', 'user_addresses.state_id = states.id')
            ->where('user_addresses.user_id', $userId)
            ->findAll();