app/Models/Admin/UsersModel.php

    public function getUserByEmail($email)
{
    return $this->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'adminold@localhost.com'
 LIMIT 1